Th0masclassic/Box_Gloving_Sensor_Detection/Prod/Box_Gloving_Sensor_Detection-Firmware/sdkconfig.defaults
# ESP32-C3 smart boxing glove baseline.  Do not use ESP32 defaults for this board.
CONFIG_IDF_TARGET="esp32c3"

# Data-ready acquisition and 2 ms BLE backoff need sub-10 ms scheduler resolution.
CONFIG_FREERTOS_HZ=1000

# NimBLE peripheral-only transport.  MTU 247 gives a 244-byte ATT notification,
# which fits in one 251-octet Data Length Extension link-layer PDU.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=247
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=24
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_SIZE=256
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=24
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_SIZE=320
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=24
CONFIG_BT_NIMBLE_TRANSPORT_ACL_SIZE=255
CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_2M_PHY=y
